snlkuharlocal/src/Documents/ХранилищеПодарочныхСертификатов/ХранилищеПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХранилищеПодарочныхСертификатов</name>
  <basedOn>Document.Инвентаризация</basedOn>
  <basedOn>Document.ОприходованиеТМЦ</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДокОбъект</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>КодСертификата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номинал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.ПодарочныеСертификаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ХранилищеПодарочныхСертификатов/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//кухарь 21.11.13 начало
	//кухарь 20.12.13 исправление косяка начало
	#если клиент тогда
		//кухарь 20.12.13 исправление косяка конец
		если ЭтоНовый() тогда
			УстановитьНомерДокумента(ЭтотОбъект);
			//кухарь 09.03.17 начало
			//чтобы ХПС на ПРМ из ТЦ в ТЦ грузились нормально
			если ДокОбъект.Метаданные().Имя="Перемещение" тогда
				Склад=ДокОбъект.Склад;
				СкладПолучатель=ДокОбъект.СкладПолучатель;
			КонецЕсли;
			//кухарь 09.03.17 конец
			
			
		КонецЕсли;
		//кухарь 20.12.13 исправление косяка начало	
	#конецесли
	//кухарь 20.12.13 исправление косяка конец
	//кухарь 21.11.13 конец	
	
	НужноВыгружать=ложь;
	ЕстьИзменения=Модифицированность();
	Если Ссылка.ПометкаУдаления<>ПометкаУдаления или ЕстьИзменения Тогда
		НужноВыгружать=истина;
	иначе
		НужноВыгружать=Ложь;
	КонецЕсли;
	
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
	
КонецПроцедуры
